Revit 2026 API

# ExportSheetType Enumeration

---

An enumerated type listing possible Sheet type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ExportSheetType
```
```vb
Public Enumeration ExportSheetType
```
```cpp
public enum class ExportSheetType
```
```fsharp
type ExportSheetType
```

| Member name | Value | Description |
| --- | --- | --- |
| Current | 0 |  |
| Select | 2 |  |
| Visible | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace